# PANDAS

In [77]:
import numpy as np

# Pandas data structure
Series and Data Structure

# Series

In [78]:
import pandas as pd

In [79]:
s = pd.Series([111,222,333,444,555,666,777])

In [80]:
s #pandas series object

0    111
1    222
2    333
3    444
4    555
5    666
6    777
dtype: int64

In [81]:
#labels/index and values

In [82]:
#getting a single series value

In [83]:
s[4]

555

In [84]:
#for more then 1

In [85]:
s[[5,0,3,1]]

5    666
0    111
3    444
1    222
dtype: int64

In [12]:
#update

In [13]:
s[3]= 1000

In [14]:
s

0     111
1     222
2     333
3    1000
4     555
5     666
6     777
dtype: int64

In [15]:
#to update multiple values
s[[2,4,0]]=[9999,7777,1111]

In [16]:
s

0    1111
1     222
2    9999
3    1000
4    7777
5     666
6     777
dtype: int64

In [17]:
#deleting a value in series

del s[4]

In [18]:
s

0    1111
1     222
2    9999
3    1000
5     666
6     777
dtype: int64

In [19]:
#multiple values cannot be deleted

In [20]:
#inserting a value
s[1234] = 356366

In [21]:
s

0         1111
1          222
2         9999
3         1000
5          666
6          777
1234    356366
dtype: int64

In [22]:
#multiple values cannot be inserted

In [23]:
s1 = pd.Series([100,200,300,400], index=["apple","orange","bananas","grapes"])

In [24]:
s1

apple      100
orange     200
bananas    300
grapes     400
dtype: int64

# creating. a series using dictionary

In [25]:
adic = {"name":"Nasir Husain","Class":"AI", "Time":"5-9"}

In [26]:
adic

{'name': 'Nasir Husain', 'Class': 'AI', 'Time': '5-9'}

In [27]:
s2 = pd.Series(adic)
s2

name     Nasir Husain
Class              AI
Time              5-9
dtype: object

In [28]:
s3 = pd.Series(s1, index=["mango","apple","orange","bananas","grapes"])

In [29]:
s3

mango        NaN
apple      100.0
orange     200.0
bananas    300.0
grapes     400.0
dtype: float64

In [30]:
s3.values

array([ nan, 100., 200., 300., 400.])

In [31]:
s3.index

Index(['mango', 'apple', 'orange', 'bananas', 'grapes'], dtype='object')

In [32]:
s3>200    #boolean

mango      False
apple      False
orange     False
bananas     True
grapes      True
dtype: bool

In [33]:
s3[s3>200]

bananas    300.0
grapes     400.0
dtype: float64

In [34]:
"mango" in s3

True

In [35]:
"Mango" in s3

False

In [87]:
pd.notnull(s3)

mango      False
apple       True
orange      True
bananas     True
grapes      True
dtype: bool

In [37]:
s2+s1

Class      NaN
Time       NaN
apple      NaN
bananas    NaN
grapes     NaN
name       NaN
orange     NaN
dtype: object

In [38]:
s4= pd.Series(s3.values,index=[22,33,44,55,66])

In [39]:
s4

22      NaN
33    100.0
44    200.0
55    300.0
66    400.0
dtype: float64

# DATA FRAME

In [40]:
df = pd.DataFrame([123,234,345,456])

In [41]:
df

     0
0  123
1  234
2  345
3  456

In [42]:
df = pd.DataFrame(["red","green","blue"],index=['v1','v2','v3'])

In [43]:
df

        0
v1    red
v2  green
v3   blue

In [44]:
df = pd.DataFrame(["red","green","blue"],index=['v1','v2','v3'],columns=["colours"])

In [45]:
df

   colours
v1     red
v2   green
v3    blue

# creating a data frame in dictionary

In [46]:
score = {"AI for EO":[76,86,76,83,86,68,96,78,98,77],
         "Python1" :[78,97,97,78,67,76,87,56,87,68],
         "Python2" : [78,97,97,78,67,76,87,56,87,68]}

In [47]:
dl = pd.DataFrame(score,index=["Nasir","Ali","Hamza","Muqeet","Faiz","Zahid","Zain","Malik","Sabir","Zaid"])

In [48]:
dl

        AI for EO  Python1  Python2
Nasir          76       78       78
Ali            86       97       97
Hamza          76       97       97
Muqeet         83       78       78
Faiz           86       67       67
Zahid          68       76       76
Zain           96       87       87
Malik          78       56       56
Sabir          98       87       87
Zaid           77       68       68

In [49]:
#data = pd.read_csv("")    #for data of exel file
#data

In [50]:
dl.head()# just will show first 5 values OR put value

        AI for EO  Python1  Python2
Nasir          76       78       78
Ali            86       97       97
Hamza          76       97       97
Muqeet         83       78       78
Faiz           86       67       67

In [51]:
dl.tail()#will show last 5 values OR put Value

       AI for EO  Python1  Python2
Zahid         68       76       76
Zain          96       87       87
Malik         78       56       56
Sabir         98       87       87
Zaid          77       68       68

In [52]:
dl.info() #

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, Nasir to Zaid
Data columns (total 3 columns):
AI for EO    10 non-null int64
Python1      10 non-null int64
Python2      10 non-null int64
dtypes: int64(3)
memory usage: 320.0+ bytes

In [53]:
dl.describe()

       AI for EO    Python1    Python2
count    10.0000  10.000000  10.000000
mean     82.4000  79.100000  79.100000
std       9.3832  13.253511  13.253511
min      68.0000  56.000000  56.000000
25%      76.2500  70.000000  70.000000
50%      80.5000  78.000000  78.000000
75%      86.0000  87.000000  87.000000
max      98.0000  97.000000  97.000000

In [54]:
dl.Python1

Nasir     78
Ali       97
Hamza     97
Muqeet    78
Faiz      67
Zahid     76
Zain      87
Malik     56
Sabir     87
Zaid      68
Name: Python1, dtype: int64

In [55]:
dl["AI for EO"]

Nasir     76
Ali       86
Hamza     76
Muqeet    83
Faiz      86
Zahid     68
Zain      96
Malik     78
Sabir     98
Zaid      77
Name: AI for EO, dtype: int64

In [56]:
dl[["AI for EO","Python1"]]

        AI for EO  Python1
Nasir          76       78
Ali            86       97
Hamza          76       97
Muqeet         83       78
Faiz           86       67
Zahid          68       76
Zain           96       87
Malik          78       56
Sabir          98       87
Zaid           77       68

In [57]:
dl.loc[["Faiz"]]

      AI for EO  Python1  Python2
Faiz         86       67       67

In [58]:
dl.loc["Faiz"]

AI for EO    86
Python1      67
Python2      67
Name: Faiz, dtype: int64

In [59]:
dl.loc[["Zain","Sabir"]]

       AI for EO  Python1  Python2
Zain          96       87       87
Sabir         98       87       87

In [60]:
dl.loc[["Zain","Sabir"]]["Python1"]

Zain     87
Sabir    87
Name: Python1, dtype: int64

In [61]:
import pandas as pd

In [62]:
dl

        AI for EO  Python1  Python2
Nasir          76       78       78
Ali            86       97       97
Hamza          76       97       97
Muqeet         83       78       78
Faiz           86       67       67
Zahid          68       76       76
Zain           96       87       87
Malik          78       56       56
Sabir          98       87       87
Zaid           77       68       68

In [63]:
dl["extra"]=[1,2,3,4,5,6,7,8,9,10]

In [64]:
dl

        AI for EO  Python1  Python2  extra
Nasir          76       78       78      1
Ali            86       97       97      2
Hamza          76       97       97      3
Muqeet         83       78       78      4
Faiz           86       67       67      5
Zahid          68       76       76      6
Zain           96       87       87      7
Malik          78       56       56      8
Sabir          98       87       87      9
Zaid           77       68       68     10

In [65]:
del dl["extra"]#delete

In [66]:
dl

        AI for EO  Python1  Python2
Nasir          76       78       78
Ali            86       97       97
Hamza          76       97       97
Muqeet         83       78       78
Faiz           86       67       67
Zahid          68       76       76
Zain           96       87       87
Malik          78       56       56
Sabir          98       87       87
Zaid           77       68       68

In [67]:
dl [["AI for EO"]+["Python1"]+["Python2"]]

        AI for EO  Python1  Python2
Nasir          76       78       78
Ali            86       97       97
Hamza          76       97       97
Muqeet         83       78       78
Faiz           86       67       67
Zahid          68       76       76
Zain           96       87       87
Malik          78       56       56
Sabir          98       87       87
Zaid           77       68       68

In [68]:
dl["total"]=dl["AI for EO"]+ dl["Python1"]+ dl["Python2"]#added all values

In [69]:
dl

        AI for EO  Python1  Python2  total
Nasir          76       78       78    232
Ali            86       97       97    280
Hamza          76       97       97    270
Muqeet         83       78       78    239
Faiz           86       67       67    220
Zahid          68       76       76    220
Zain           96       87       87    270
Malik          78       56       56    190
Sabir          98       87       87    272
Zaid           77       68       68    213

In [70]:
dl["total"]

Nasir     232
Ali       280
Hamza     270
Muqeet    239
Faiz      220
Zahid     220
Zain      270
Malik     190
Sabir     272
Zaid      213
Name: total, dtype: int64

In [71]:
dl["status"]=dl["total"]>200

In [72]:
dl

        AI for EO  Python1  Python2  total  status
Nasir          76       78       78    232    True
Ali            86       97       97    280    True
Hamza          76       97       97    270    True
Muqeet         83       78       78    239    True
Faiz           86       67       67    220    True
Zahid          68       76       76    220    True
Zain           96       87       87    270    True
Malik          78       56       56    190   False
Sabir          98       87       87    272    True
Zaid           77       68       68    213    True

In [73]:
import pandas as pd

In [86]:
dl["status"]=np.where((dl['total']>200),"pass","fail")
dl

        AI for EO  Python1  Python2  total status
Nasir          76       78       78    232   pass
Ali            86       97       97    280   pass
Hamza          76       97       97    270   pass
Muqeet         83       78       78    239   pass
Faiz           86       67       67    220   pass
Zahid          68       76       76    220   pass
Zain           96       87       87    270   pass
Malik          78       56       56    190   fail
Sabir          98       87       87    272   pass
Zaid           77       68       68    213   pass

In [75]:
dl["status"]=["pass"if marks>200 else "fail"for marks in dl["total"]]

In [76]:
dl

        AI for EO  Python1  Python2  total status
Nasir          76       78       78    232   pass
Ali            86       97       97    280   pass
Hamza          76       97       97    270   pass
Muqeet         83       78       78    239   pass
Faiz           86       67       67    220   pass
Zahid          68       76       76    220   pass
Zain           96       87       87    270   pass
Malik          78       56       56    190   fail
Sabir          98       87       87    272   pass
Zaid           77       68       68    213   pass

In [94]:
dl["status"]=np.where(dl['total']>200,"pass","fail")

In [95]:
dl["RevisedStatus"]=np.where(((dl["AI for EO"]>=50) & (dl["Python1"]>=50) & (dl["Python2"]>=50)),"pass","fail")
dl

        AI for EO  Python1  Python2  total status RevisedStatus newstatus
Nasir          76       78       78    232   pass          pass      pass
Ali            86       97       97    280   pass          pass      pass
Hamza          76       97       97    270   pass          pass      pass
Muqeet         83       78       78    239   pass          pass      pass
Faiz           86       67       67    220   pass          pass      pass
Zahid          68       76       76    220   pass          pass      pass
Zain           96       87       87    270   pass          pass      pass
Malik          78       56       56    190   fail          pass      pass
Sabir          98       87       87    272   pass          pass      pass
Zaid           77       68       68    213   pass          pass      pass

In [96]:
dl["newstatus"]=["pass" if (ai>=50) &(p1>=50) & (p2>=50) else "fail" for ai,p1,p2 in zip(dl["AI for EO"], dl["Python1"], dl["Python2"])]

In [93]:
dl

        AI for EO  Python1  Python2  total status RevisedStatus newstatus
Nasir          76       78       78    232   pass          pass      pass
Ali            86       97       97    280   pass          pass      pass
Hamza          76       97       97    270   pass          pass      pass
Muqeet         83       78       78    239   pass          pass      pass
Faiz           86       67       67    220   pass          pass      pass
Zahid          68       76       76    220   pass          pass      pass
Zain           96       87       87    270   pass          pass      pass
Malik          78       56       56    190   fail          pass      pass
Sabir          98       87       87    272   pass          pass      pass
Zaid           77       68       68    213   pass          pass      pass